#+TITLE: Starter Kit Gnus
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:starter-kit.gnus][Emacs Starter Kit]].

*** Getting mail
Set Gmail as the primary source for incoming mail (Gnus can aggregate
many email and/or newsgroup sources).
#+begin_src emacs-lisp
  (require 'nnir)

  ;; @see http://www.emacswiki.org/emacs/GnusGmail#toc1
  (setq gnus-select-method '(nntp "news.gmane.org"))
  (setq pop3-leave-mail-on-server t)

  ;; ask encyption password once
  (setq epa-file-cache-passphrase-for-symmetric-encryption t)

  (add-to-list 'gnus-secondary-select-methods
               '(nnimap "gmail"
                        (nnimap-address "imap.gmail.com")
                        (nnimap-server-port 993)
                        (nnimap-stream ssl)
                        (nnir-search-engine imap)
                        (nnimap-expunge-on-close always)
                        (gnus-check-new-newsgroups nil)
                        ; @see http://www.gnu.org/software/emacs/manual/html_node/gnus/Expiring-Mail.html
                        ;; press 'E' to expire email
                        (nnmail-expiry-target "nnimap+gmail:[Gmail]/Bin")
                        (nnmail-expiry-wait 90)))
  ;; (add-to-list 'gnus-secondary-select-methods
  ;;              '(nnimap "outlook"
  ;;                       (nnimap-address "outlook.com")
  ;;                       (nnimap-server-port 1143)
  ;;                       (nnimap-stream ssl)
  ;;                       (nnir-search-engine imap)
  ;;                       (nnimap-expunge-on-close newer)
  ;;                       (gnus-check-new-newsgroups nil)
  ;;                       (nnmail-expiry-wait 90)))
#+end_src

#+RESULTS:
| nnimap | outlook | (nnimap-address outlook.com) | (nnimap-server-port 993) | (nnimap-stream ssl) | (nnir-search-engine imap) | (nnimap-expunge-on-close newer)  | (gnus-check-new-newsgroups nil) | (nnmail-expiry-wait 90)                           |                         |
| nnimap | gmail   | (nnimap-address imap.gmail.com)                | (nnimap-server-port 993) | (nnimap-stream ssl) | (nnir-search-engine imap) | (nnimap-expunge-on-close always) | (gnus-check-new-newsgroups nil) | (nnmail-expiry-target nnimap+gmail:[Gmail]/Trash) | (nnmail-expiry-wait 90) |


